Repository: katrinleinweber/openafs_cvs
Catalog: src/packaging/Debian/po/*.po
Languages: pt_br

source: What hosts are DB servers for your home cell?
pt_br: Quais hosts são servidor DB para sua célula home ?

source: AFS uses the file /etc/openafs/CellServDB to hold the list of servers that should be contacted to find parts of a cell. The cell you claim this workstation belongs to is not in that file. Enter the host names of the database servers separated by spaces. IMPORTANT: If you are creating a new cell and this machine is to be a database server in that cell, only enter this machine's name; add the other servers later after they are functioning. Also, do not enable the AFS client to start at boot on this server until the cell is configured. When you are ready you can edit /etc/openafs/afs.conf.client to enable the client.
pt_br: O AFS usa o arquivo /etc/openafs/CellServDB para armazenar a lista de servidores que deverão ser contactados para se encontrar partes de uma célula. A célula que você diz que essa estação de trabalho pertence não está nesse arquivo. Informe os nomes de hosts dos servidore de base de dados separados por espaços. IMPORTANTE : Caso você esteja criando uma nova célula e esta máquina será um servidor de base de dados na célula, somente informe o nome desta máquina. Adicione os outros servidores posteriormente depois que os mesmos estejam funcionando. Adicionalmente, não habilite o cliente AFS para inicialização em tempo de inicialização neste servidor até que a célula esteja configurada. Quando você estiver terminado você poderá editar o arquivo /etc/openafs/afs.conf.client para habilitar este cliente.

source: What AFS cell does this workstation belong to?
pt_br: A qual célula AFS esta estação de trabalho pertence ?

source: AFS filespace is organized into cells or administrative domains. Each workstation belongs to one cell. Usually the cell is the DNS domain name of the site.
pt_br: O espaço de arquivo AFS é organizado em células ou domínios administrativos. Cada estação de trabalho pertence a uma célula. Normalmente a célula é o nome de domínio DNS do site.

source: How large is your AFS cache (kB)?
pt_br: Qual o tamanho de seu cache AFS (KB) ?

source: AFS uses an area of the disk to cache remote files for faster access. This cache will be mounted on /var/cache/openafs. It is important that the cache not overfill the partition it is located on. Often, people find it useful to dedicate a partition to their AFS cache.
pt_br: O AFS usa uma àrea do disco para fazer cache de arquivos remotos para acesso mais rápido. Esse cache será montando em /var/cache/openafs. É importante que o cache não ocupe toda a partrição na qual está localizado. Geralmente, os usuários AFS acham útil dedicar uma partição para seus caches AFS.

source: Run Openafs client now and at boot?
pt_br: Executar o cliente OpenAFS agora e em tempo de inicialização ?

source: Should the Openafs filesystem be started and mounted at boot? Normally, most users who install the openafs-client package expect to run it at boot. However, if you are planning on setting up a new cell or are on a laptop, you may not want it started at boot time. If you choose not to start AFS at boot, run /etc/init.d/openafs-client force-start to start the client when you wish to run it.
pt_br: O sistema de arquivos OpenAFS deverá ser iniciado e montando em tempo de inicialização ? Normalmente, a maioria dos usuários que instalam o pacote openafs-client esperam executá-lo em tempo de inicialização. Porém, caso você esteja planejando configurar uma nova célula ou esteja em um laptop, você pode não desejar iniciar o OpenAFS em tempo de inicialização. Caso você opte por não iniciar o AFS em tempo de inicialização, execute /etc/init.d/openafs-cliente force-start para iniciar o cliente quando desejar executá-lo.

source: Look up AFS cells in DNS?
pt_br: Procurar células AFS no DNS ?

source: In order to contact an AFS cell, you need the IP addresses of the cell's database servers. Normally, this information is read from /etc/openafs/CellServDB. However, if Openafs cannot find a cell in that file, it can use DNS to look for AFSDB records that contain the information.
pt_br: Para poder contactar uma célula AFS, você precisa dos endereços IP dos servidores de base de dados da célula. Normalmente, esta informação é lida de /etc/openafs/CellServDB. Porém, caso o OpenAFS não possa encontrar uma célula nesse arquivo, o DNS poderá ser usado para pesquisar registros AFSDB que contenham a informação.

source: Encrypt authenticated traffic with AFS fileserver?
pt_br: Encriptar o tráfego autenticado com o servidor de arquivos AFS ?

source: AFS provides a weak form of encryption that can optionally be used between a client and the fileservers. While this encryption is weaker than DES and thus is not sufficient for highly confidential data, it does provide some confidentiality and is likely to make the job of a casual attacker significantly more difficult.
pt_br: O AFS fornece uma forma fraca de encriptação que pode ser opcionalmente usada entre o cliente e os servidor de arquivos. Enquanto esta encriptação é mais fraca do que DES e portanto não é suficiente para dados altamente confidenciais, essa encriptação fornece alguma confidencialidade e provavelmente torna o trabalho de um atacante casual mais difícil.

source: Dynamically generate the contents of /afs?
pt_br: Gerar dinamicamente o conteúdo de /afs ?

source: /afs generally contains an entry for each cell that a client can talk to. Traditionally, these entries were generated by servers in the client's home cell. However, OpenAFS clients can generate the contents of /afs dynamically based on the contents of /etc/openafs/CellServDB and DNS.
pt_br: O /afs geralmente contém uma entrada para cada célula com a qual o cliente pode conversar. Tradicionalmente, essas entradas eram geradas por servidores no célula home do cliente. Porém, clientes OpenAFS podem gerar o conteúdo de /afs dinamicamente baseando-se no conteúdo de /etc/openafs/CellServDB e do DNS.

source: If you generate /afs dynamically, you may need to create /etc/openafs/CellAlias to include aliases for common cells. (The syntax of this file is one line per alias, with the cell name, a space, and then the alias for that cell.)
pt_br: Caso você gere o /afs dinamicamente, você pode precisar criar o /etc/openafs/CellAlias para incluir apelidos (aliases) para células comuns. (A sintaxe desse arquivo é uma linha por apelido, com o nome da célula, um espaço e depois o apelido para a célula.)

source: Use fakestat to avoid hangs when listing /afs?
pt_br: Usar fakestat para evitar travadas na listagem do /afs ?

source: Because AFS is a global file space, operations on the /afs directory can generate significant network traffic. If some AFS cells are unavailable then looking at /afs using ls or a graphical file browser may hang your machine for minutes. AFS has an option to simulate answers to these operations locally to avoid these hangs. You want this option under most circumstances.
pt_br: Devido ao AFS ser um espaço de arquivos global, operações no diretório /afs podem gerar um tráfego de rede significativo. Caso algumas células AFS não estejam disponíveis, pesquisar o /afs usando o comando "ls" ou um gerenciador de arquivos gráfico pode travar sua máquina por alguns minutos. O AFS possui uma opção para simular respostas para essas operações localmente para evitar essas travadas. Você irá desejar usar esta opção na maioria dos casos.

source: What cell does this server serve files for?
pt_br: Para qual célula este servidor serve arquivos ?

source: AFS fileservers belong to a cell. They have the key for that cell's Kerberos service and serve volumes into that cell. Normally, this cell is the same cell as the workstation's client belongs to.
pt_br: Servidor de arquivos AFS pertencem a uma célula. Eles possuem uma chave para cada serviço Kerberos da célula e servem volumes dentro da célula. Normalmente, essa célula é a mesma célula da qual a estação de trabalho faz parte.

source: Upgrading will move files to new locations; continue?
pt_br: Atualizar irá mover arquivo para novos locais. Continuar ?

source: Between Openafs 1.1 and Openafs 1.2, several files moved. In particular, files in /etc/openafs/server-local have been distributed to other locations. The BosConfig file is now located in /etc/openafs and the other files are located in /var/lib/openafs. If you continue with this upgrade, these files will be moved. You should use the bos restart command to reload your servers. Any configuration changes made before you do so will be lost.
pt_br: Entre as versões do OpenAFS 1.1 e do OpenAFS 1.2, diversos arquivos foram movidos. Em particular, aruivos em /etc/openafs/server-local foram distribuídos para outros locais. O arquivo BosConfig está agora localizado em /etc/openafs e os outros arquivos estão localizados em /var/lib/openafs. Caso você continue com esta atualização, esses arquivos serão movidos. Você deverá usar o comando "bos restart" para recarregar seus servidores. Quaisquer mudanças em configurações feitas antes que você tenha feito isso serão perdidas.

source: OpenAFS file server probably does not work!
pt_br: Servidor de Arquivos OpenAFS provavelmente não funciona !

source: You are running the OpenAFS file server package on an alpha. This probably doesn't work; the DES code is flaky on the alpha, along with the threaded file server. Likely, the fileserver will simply fail to start, but if it does load, data corruption may result. You have been warned.
pt_br: Você está executando o pacote do servidor de arquivos OpenAFS em uma máquina Alpha. Isso provavelmente não funcionará. O código DES é em conjunto com o servidor de arquivos com suporte a threads é problemático em máquinas Alpha. Provavelmente, o servidor de arquivos irá simplesmente falhar ao iniciar. Caso consiga ser iniciado, poderá causar corrupção de dados. Você foi avisado.
